src_doc/Catalogs/ТипыСвязей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТипыСвязей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>37</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНаименованиеЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>37</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНаименованиеЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>37</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_doc/Catalogs/ТипыСвязей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей типов связей
//
// Возвращаемое значение:
//   Структура
//     Наименование
//
Функция ПолучитьСтруктуруТиповСвязей() Экспорт
	
	ПараметрыТиповСвязей = Новый Структура;
	ПараметрыТиповСвязей.Вставить("Наименование");
	
	Возврат ПараметрыТиповСвязей;
	
КонецФункции

// Создает и записывает в БД тип связи
//
// Параметры:
//   СтруктураТиповСвязей - Структура - структура полей типов связей.
//
Функция СоздатьТипСвязи(СтруктураТиповСвязей) Экспорт
	
	НовыйТипСвязи = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйТипСвязи, СтруктураТиповСвязей);
	НовыйТипСвязи.Записать();
	
	Возврат НовыйТипСвязи.Ссылка;
	
КонецФункции

// Возвращает типы связей, которые не должны отображаться в списке выбора.
//
// Возвращаемое значение:
//   Массив из СправочникСсылка.ТипыСвязей
//
Функция СкрытыеТипы() Экспорт
	
	СкрытыеТипы = Новый Массив;
	СкрытыеТипы.Добавить(СодержитСсылкуНаИнтегрированныйОбъект);
	
	Возврат СкрытыеТипы;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
// 
// Параметры:
//  Настройки - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов.Настройки
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт

	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;

КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АвансовыйОтчет";
	Наименование = "ru = 'Авансовый отчет'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВходитВКомплект";
	Наименование = "ru = 'Входит в комплект'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка на комплект документов'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков); 
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДелаетНеДействующим";
	Наименование = "ru = 'Делает недействующим'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка из документа, который отменяет (расторгает) другие документы'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Исправление";
	Наименование = "ru = 'Исправление'"; // @НСтр-2              
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	    
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ИсправлениеК";
	Наименование = "ru = 'Исправление к'"; // @НСтр-2        
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Корректировка";
	Наименование = "ru = 'Корректировка'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КорректировкаК";
	Наименование = "ru = 'Корректировка к'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НаОснованииПисьма";
	Наименование = "ru = 'На основании письма'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка из входящих, исходящих, документов предприятия и проектов на входящее или исходящее письмо'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НеДействуетВСоответствии";
	Наименование = "ru = 'Не действует в соответствии'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка из отмененного документа на тот, который его отменяет'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОплатаПоЗаявке";
	Наименование = "ru = 'Оплата по заявке'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
		
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОплаченоДокументом";
	Наименование = "ru = 'Оплачено документом'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтправилоДокумент";
	Наименование = "ru = 'Отправило документ'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтправленВОтветНа";
	Наименование = "ru = 'Отправлен в ответ на'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка из исходящего на документ, в ответ на который он отправлен'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВОтветНаПереадресованное";
	Наименование = "ru = 'Отправлен в ответ на переадресованное'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка на входящий документ, полученный при переадресации, в ответ на который отправляется ответ переадресовавшему'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтправленВОтветНаПисьмо";
	Наименование = "ru = 'Отправлен в ответ на письмо'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	 
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтправленОтвет";
	Наименование = "ru = 'Отправлен ответ'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка на исходящий документ, отправленный в ответ на входящий'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтветПереадресовавшему";
	Наименование = "ru = 'Отправлен ответ переадресовавшему'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка на исходящий документ, отправленный в качестве ответа переадресовавшему'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтправленОтветныйДокумент";
	Наименование = "ru = 'Отправлен ответный документ'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтправленоОтветноеПисьмо";
	Наименование = "ru = 'Отправлено ответное письмо'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереадресацияДокумента";
	Наименование = "ru = 'Переадресация документа'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка из исходящего на документ, который он переадресовывает'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
 	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереадресацияДокументаПоВопросу";
	Наименование = "ru = 'Переадресация документа по вопросу'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереадресованДокументом";
	Наименование = "ru = 'Переадресован документом'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка из входящего на документ, который его переадресовал'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереадресованДокументомПоВопросу";
	Наименование = "ru = 'Переадресован документом по вопросу'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	
		
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПеренаправлениеПисьма";
	Наименование = "ru = 'Перенаправление письма'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПеренаправленоПисьмом";
	Наименование = "ru = 'Перенаправлено письмом'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПерепискаПоПредмету";
	Наименование = "ru = 'Переписка по предмету'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка на входящие и исходящие документы, при помощи которых ведется переписка по предмету'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПересланоПисьмом";
	Наименование = "ru = 'Переслано письмом'"; // @НСтр-2
	Комментарий = ""; 
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПересылкаПисьма";
	Наименование = "ru = 'Пересылка письма'"; // @НСтр-2
	Комментарий = ""; 
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПисьмоОтправленоВОтветНа";
	Наименование = "ru = 'Письмо отправлено в ответ на'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПисьмоОснование";
	Наименование = "ru = 'Письмо-основание'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка из входящего или исходящего письма на входящий, исходящий, документ предприятия или проект'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПолученВОтветНа";
	Наименование = "ru = 'Получен в ответ на'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка из входящего на документ, в ответ на который он получен'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПолученВОтветНаПисьмо";
	Наименование = "ru = 'Получен в ответ на письмо'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПолученОтвет";
	Наименование = "ru = 'Получен ответ'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка на входящий документ, полученный в ответ на исходящий'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);		
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПолученОтветныйДокумент";
	Наименование = "ru = 'Получен ответный документ'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПолученоВОтветНаДокумент";
	Наименование = "ru = 'Получено в ответ на документ'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПолученоВОтветНаПисьмо";
	Наименование = "ru = 'Получено в ответ на письмо'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПолученоОтветноеПисьмо";
	Наименование = "ru = 'Получено ответное письмо'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПредметОплаты";
	Наименование = "ru = 'Предмет оплаты'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Содержит";
	Наименование = "ru = 'Содержит'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка на элемент комплекта'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПредметПереписки";
	Наименование = "ru = 'Содержит переписку по'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка из входящих и исходящих на предмет переписки'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СоздалоДокумент";
	Наименование = "ru = 'Создало документ'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОсновноеОбращение";
	Наименование = "ru = 'Является дубликатом для'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка из дубликата на основное обращение'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Дубликат";
	Наименование = "ru = 'Является основным для'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка из основного обращения на дубликат'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПовторноеОбращение";
	Наименование = "ru = 'Является первичным для'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка из первичного на повторное обращение'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПервичноеОбращение";
	Наименование = "ru = 'Является повторным для'"; // @НСтр-2
	Комментарий = "ru = 'Ссылка из повторного на первичное обращение'"; // @НСтр-2
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СодержитСсылкуНаИнтегрированныйОбъект";
	Наименование = "ru = '(не используется) Содержит ссылку на'"; // @НСтр-2
	Комментарий = "";
	ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков);	
	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МультиязычностьСервер.ОбработкаПолученияДанныхВыбора(
		ДанныеВыбора,
		Параметры,
		СтандартнаяОбработка,
		Метаданные.Справочники.ТипыСвязей);
	
	Если ТипЗнч(ДанныеВыбора) = Тип("СписокЗначений") Тогда
		Для Каждого СкрытыйТип Из СкрытыеТипы() Цикл
			НайденныйЭлемент = ДанныеВыбора.НайтиПоЗначению(СкрытыйТип);
			Если НайденныйЭлемент <> Неопределено Тогда
				ДанныеВыбора.Удалить(НайденныйЭлемент);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ДанныеВыбора = Новый СписокЗначений;
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ТипыСвязей.Ссылка КАК Ссылка,
			|	ТипыСвязей.СокращенноеНаименование КАК СокращенноеНаименование
			|ИЗ
			|	Справочник.ТипыСвязей КАК ТипыСвязей
			|ГДЕ
			|	НЕ ТипыСвязей.Ссылка В (&СкрытыеТипы)
			|	И НЕ ТипыСвязей.ПометкаУдаления
			|	И ТипыСвязей.СокращенноеНаименование ПОДОБНО &СтрокаПоиска
			|
			|УПОРЯДОЧИТЬ ПО
			|	СокращенноеНаименование");
		Запрос.УстановитьПараметр("СкрытыеТипы", СкрытыеТипы());
		Запрос.УстановитьПараметр("СтрокаПоиска",
			?(Параметры.СтрокаПоиска = Неопределено, "", Параметры.СтрокаПоиска) + "%");
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.СокращенноеНаименование);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

Процедура ОбновитьПредопределенныйЭлемент(Элемент, Наименование, Комментарий, КодыЯзыков)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность") Тогда
		МодульМультиязычностьСервер = ОбщегоНазначения.ОбщийМодуль("МультиязычностьСервер");
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", Наименование, КодыЯзыков); 
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "СокращенноеНаименование", Наименование, КодыЯзыков);
		Если Не ПустаяСтрока(Комментарий) Тогда
			МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Комментарий", Комментарий, КодыЯзыков);
		КонецЕсли;	
	Иначе
		Элемент.Наименование = НСтр(Наименование, ОбщегоНазначения.КодОсновногоЯзыка());
		Элемент.СокращенноеНаименование = НСтр(Наименование, ОбщегоНазначения.КодОсновногоЯзыка());
			Если Не ПустаяСтрока(Комментарий) Тогда
				Элемент.Комментарий = НСтр(Комментарий, ОбщегоНазначения.КодОсновногоЯзыка());
			КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти


#КонецЕсли
